# DXFExportOptions Constructor (DXFExportOptions) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DXFExportOptions Constructor (DXFExportOptions)
DXFExportOptions Class See Also
---
Constructs a new instance of DXFImportOptions as a copy of the export options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public DXFExportOptions(
	DXFExportOptions option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As DXFExportOptions _
)
```

Visual C++
---
```text
public:
DXFExportOptions(
	DXFExportOptions^ option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..DXFExportOptions The options to be copied.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DXFExportOptions Class
DXFExportOptions Overload
Autodesk.Revit.DB Namespace